%% RM_16_11
clear; clc;

cfg = struct();

cfg.L     = 16;
cfg.LLR_W = 6;
cfg.FSM   = 0;

% Оборачиваем в структуру с ключом 'default'
cfg.MakeTables = struct('key', 'default', 'table', [
    "0000", "1111";
    "1011", "0100";
    "1101", "0010";
    "0110", "1001";
    "1110", "0001";
    "0101", "1010";
    "0011", "1100";
    "1000", "0111"
]);

% Оборачиваем в структуру с ключом 'default'
cfg.CombTables = struct('key', 'default', 'table', [
    0 0 0; 0 5 5; 0 3 3; 0 6 6;
    1 2 2; 1 7 7; 1 1 1; 1 4 4;
    2 6 3; 2 3 6; 2 5 0; 2 0 5;
    3 4 1; 3 1 4; 3 7 2; 3 2 7;
    4 6 0; 4 5 6; 4 3 5; 4 0 6;
    5 4 2; 5 1 7; 5 7 1; 5 2 4;
    6 0 3; 6 5 6; 6 3 0; 6 6 5;
    7 2 1; 7 7 4; 7 1 2; 7 4 7
]);

cfg.SECT = {
    [0 4; 4 8; 8 12; 12 16];
    [0 8; 8 16];
    [0 16]
};

gen_top('C:\LRMLD\decoders\RM_N16_K11\top_16_L16_fsm0.sv',cfg);
%% RM_32_16
clear; clc;

cfg = struct();

cfg.L     = 8;
cfg.LLR_W = 8;
cfg.FSM   = 0;

cfg.module_name = 'top_32';

% Оборачиваем в структуру с ключом 'default'
cfg.MakeTables = struct('key', 'default', 'table', [
    "0000", "1111";
    "1011", "0100";
    "1101", "0010";
    "0110", "1001";
    "1110", "0001";
    "0101", "1010";
    "0011", "1100";
    "1000", "0111"
]);

% Оборачиваем в структуру с ключом 'default'
cfg.CombTables = struct('key', 'default', 'table', [
    0 0 0; 0 5 5; 0 3 3; 0 6 6;
    1 2 2; 1 7 7; 1 1 1; 1 4 4;
    2 6 3; 2 3 6; 2 5 0; 2 0 5;
    3 4 1; 3 1 4; 3 7 2; 3 2 7;
    4 6 0; 4 5 6; 4 3 5; 4 0 6;
    5 4 2; 5 1 7; 5 7 1; 5 2 4;
    6 0 3; 6 5 6; 6 3 0; 6 6 5;
    7 2 1; 7 7 4; 7 1 2; 7 4 7
]);

cfg.SECT = {
    [0 4; 4 8; 8 12; 12 16; 16 20; 20 24; 24 28; 28 32];
    [0 8; 8 16; 16 24; 24 32];
    [0 16; 16 32]
    [0 32]
};

gen_top('top_32_L8_fsm0.sv',cfg);


%% нессиметричка
% RM_64 
clear; clc;

cfg = struct();
cfg.L     = 4;
cfg.LLR_W = 6;
cfg.FSM   = 0;

cfg.module_name = 'top_64';

cfg.MakeTables = struct('key', 'default', 'table', [
    "0000", "1111";
    "1011", "0100";
    "1101", "0010";
    "0110", "1001";
    "1110", "0001";
    "0101", "1010";
    "0011", "1100";
    "1000", "0111"
]);

cfg.CombTables = struct('key', 'default', 'table', [
    0 0 0; 0 5 5; 0 3 3; 0 6 6;
    1 2 2; 1 7 7; 1 1 1; 1 4 4;
    2 6 3; 2 3 6; 2 5 0; 2 0 5;
    3 4 1; 3 1 4; 3 7 2; 3 2 7;
    4 6 0; 4 5 6; 4 3 5; 4 0 6;
    5 4 2; 5 1 7; 5 7 1; 5 2 4;
    6 0 3; 6 5 6; 6 3 0; 6 6 5;
    7 2 1; 7 7 4; 7 1 2; 7 4 7
]);

cfg.SECT = {
    [32 36; 36 40; 40 44; 44 48; 48 52; 52 56; 56 60; 60 64];
    [16 20; 20 24; 24 28; 28 32; 32 40; 40 48; 48 56; 56 64];
    [16 24; 24 32; 32 48; 48 64];
    [8 12; 12 16; 16 32; 32 64];
    [8 16; 16 64];
    [4 8; 8 64];
    [0 4; 4 64];
    [0 64]
};

gen_top('C:\LRMLD\decoders\ASYM_N64\top_64_L4_fsm0.sv', cfg);
%% 64, разные таблицы
clear; clc;
cfg = struct();
cfg.L     = 3;
cfg.LLR_W = 6;
cfg.FSM   = 3;
cfg.module_name = 'top_64';

% 1. Задаем базовую таблицу, которая пойдет во все модули по умолчанию
cfg.MakeTables(1).key   = 'default';
cfg.MakeTables(1).table = [
    "0000", "1111";
    "1011", "0100";
    "1101", "0010";
    "0110", "1001";
    "1110", "0001";
    "0101", "1010";
    "0011", "1100";
    "1000", "0111"
];

% 2. Переопределяем таблицу для конкретного модуля make на отрезке [32 36]
cfg.MakeTables(2).key   = '32_36';
cfg.MakeTables(2).table = [
    "0000", "0000";
    "1111", "1111"; 
    "0101", "0101";
    "1010", "1010";
    "1100", "1100";
    "0011", "0011"; 
    "0110", "0110";
    "1001", "1001"
];

% 3. Переопределяем таблицу для СОСЕДНЕГО модуля на том же уровне [36 40]
cfg.MakeTables(3).key   = '36_40';
cfg.MakeTables(3).table = [
    "1111", "0000";
    "0000", "1111"; 
    "1010", "0101";
    "0101", "1010";
    "0011", "1100";
    "1100", "0011"; 
    "1001", "0110";
    "0110", "1001"
];

% Таблицы для COMB работают по точно такому же принципу
cfg.CombTables(1).key   = 'default';
cfg.CombTables(1).table = [
    0 0 0; 0 5 5; 0 3 3; 0 6 6;
    1 2 2; 1 7 7; 1 1 1; 1 4 4;
    2 6 3; 2 3 6; 2 5 0; 2 0 5;
    3 4 1; 3 1 4; 3 7 2; 3 2 7;
    4 6 0; 4 5 6; 4 3 5; 4 0 6;
    5 4 2; 5 1 7; 5 7 1; 5 2 4;
    6 0 3; 6 5 6; 6 3 0; 6 6 5;
    7 2 1; 7 7 4; 7 1 2; 7 4 7
];

% cfg.CombTables(2).key   = '32_40';
% cfg.CombTables(2).table = [ ... ];

cfg.SECT = {
    [32 36; 36 40; 40 44; 44 48; 48 52; 52 56; 56 60; 60 64];
    [16 20; 20 24; 24 28; 28 32; 32 40; 40 48; 48 56; 56 64];
    [16 24; 24 32; 32 48; 48 64];
    [8 12; 12 16; 16 32; 32 64];
    [8 16; 16 64];
    [4 8; 8 64];
    [0 4; 4 64];
    [0 64]
};

gen_top('top_64_dif_tbls.sv', cfg);